const alphabet = {
  "0": [
    "0️⃣"
  ],
  "1": [
    "1️⃣"
  ],
  "2": [
    "2️⃣"
  ],
  "3": [
    "3️⃣"
  ],
  "4": [
    "4️⃣"
  ],
  "5": [
    "5️⃣"
  ],
  "6": [
    "6️⃣"
  ],
  "7": [
    "7️⃣"
  ],
  "8": [
    "8️⃣"
  ],
  "9": [
    "9️⃣"
  ],
  "A": [
    "🅰️",
    "🇦",
    "🅰",
    "🍙",
    "🔼",
    "🔺",
    "🅐",
    "Ⓐ",
    "🄰",
    "ⓐ",
    "а",
    "à",
    "á",
    "ạ",
    "ą"
  ],
  "B": [
    "🅱️️",
    "🇧",
    "🅱",
    "🔔",
    "🔕",
    "🅑",
    "Ⓑ",
    "🄱",
    "ⓑ"
  ],
  "C": [
    "©️",
    "☪️",
    "🗜️",
    "🇨",
    "🅲",
    "🅒",
    "Ⓒ",
    "🄲",
    "ⓒ",
    "с",
    "ƈ",
    "ċ"
  ],
  "D": [
    "↩️",
    "🇩",
    "🅳",
    "🅓",
    "Ⓓ",
    "🄳",
    "ⓓ",
    "ԁ",
    "ɗ"
  ],
  "E": [
    "🅴",
    "📧",
    "🇪",
    "🅴",
    "🅔",
    "Ⓔ",
    "🄴",
    "ⓔ",
    "е",
    "ẹ",
    "ė",
    "ė",
    "é",
    "è"
  ],
  "F": [
    "🎏",
    "🇫",
    "🅵",
    "🅕",
    "Ⓕ",
    "🄵",
    "ⓕ"
  ],
  "G": [
    "🅶",
    "⛽️",
    "🇬",
    "🅶",
    "🅖",
    "Ⓖ",
    "🄶",
    "ⓖ",
    "ġ"
  ],
  "H": [
    "🏩",
    "♓️",
    "🇭",
    "🅷",
    "🅗",
    "Ⓗ",
    "🄷",
    "ⓗ",
    "һ"
  ],
  "I": [
    "💈",
    "ℹ️",
    "🇮",
    "🅸",
    "🅘",
    "Ⓘ",
    "🄸",
    "ⓘ",
    "і",
    "í",
    "ì",
    "ï"
  ],
  "J": [
    "☔",
    "🎷",
    "🗾",
    "🇯",
    "🅹",
    "🅙",
    "Ⓙ",
    "🄹",
    "ⓙ",
    "ј",
    "ʝ"
  ],
  "K": [
    "🅺",
    "🎋",
    "🇰",
    "🅺",
    "🅚",
    "Ⓚ",
    "🄺",
    "ⓚ",
    "κ"
  ],
  "L": [
    "👢",
    "🕒",
    "🇱",
    "🅻",
    "🅛",
    "Ⓛ",
    "🄻",
    "ⓛ",
    "ӏ",
    "ḷ"
  ],
  "M": [
    "Ⓜ️",
    "♏️",
    "♍️",
    "〽",
    "🇲",
    "🅼",
    "🅜",
    "Ⓜ",
    "🄼",
    "ⓜ"
  ],
  "N": [
    "🅽",
    "📈",
    "🇳",
    "🅽",
    "🅝",
    "Ⓝ",
    "🄽",
    "ⓝ",
    "ո"
  ],
  "O": [
    "🅾️",
    "⭕️",
    "💍",
    "🇴",
    "🅾",
    "🔘",
    "🔴",
    "🔵",
    "🅞",
    "Ⓞ",
    "🄾",
    "ⓞ",
    "о",
    "ο",
    "օ",
    "ȯ",
    "ọ",
    "ỏ",
    "ơ",
    "ö",
    "ó",
    "ò"
  ],
  "P": [
    "🅿️",
    "🇵",
    "🅿",
    "🅟",
    "Ⓟ",
    "🄿",
    "ⓟ",
    "р"
  ],
  "Q": [
    "🍳",
    "🍭",
    "♌",
    "🇶",
    "ℚ",
    "℺",
    "🇶",
    "🅀",
    "🆀",
    "🅠",
    "Ⓠ",
    "🅀",
    "ⓠ",
    "զ"
  ],
  "R": [
    "Ⓡ",
    "®️",
    "🇷",
    "🅁",
    "🆁",
    "🅡",
    "Ⓡ",
    "🅁",
    "ⓡ"
  ],
  "S": [
    "💰",
    "⚡️",
    "🇸",
    "🅂",
    "🆂",
    "🅢",
    "Ⓢ",
    "🅂",
    "ⓢ",
    "ʂ"
  ],
  "T": [
    "🏋",
    "✝️",
    "🇹",
    "🅃",
    "🆃",
    "🅣",
    "Ⓣ",
    "🅃",
    "ⓣ"
  ],
  "U": [
    "🐋",
    "⛎",
    "🇺",
    "🅄",
    "🆄",
    "🅤",
    "Ⓤ",
    "🅄",
    "ⓤ",
    "υ",
    "ս",
    "ü",
    "ú",
    "ù"
  ],
  "V": [
    "✌️️",
    "♈️",
    "🇻",
    "🅅",
    "🆅",
    "🅥",
    "Ⓥ",
    "🅅",
    "ⓥ",
    "ν",
    "ѵ"
  ],
  "W": [
    "👐",
    "〰️",
    "🇼",
    "🅆",
    "🆆",
    "🅦",
    "Ⓦ",
    "🅆",
    "ⓦ"
  ],
  "X": [
    "❎",
    "❌",
    "✖️",
    "🙅",
    "🇽",
    "🅇",
    "🆇",
    "🅧",
    "Ⓧ",
    "🅇",
    "ⓧ",
    "х",
    "ҳ"
  ],
  "Y": [
    "🌱",
    "🍸",
    "🇾",
    "🅈",
    "🆈",
    "🅨",
    "Ⓨ",
    "🅈",
    "ⓨ",
    "у",
    "ý"
  ],
  "Z": [
    "💤",
    "🇿",
    "🅉",
    "🆉",
    "🅩",
    "Ⓩ",
    "🅉",
    "ⓩ",
    "ʐ",
    "ż"
  ],
  "!": [
    "❗️",
    "❕"
  ],
  "?": [
    "❓",
    "❔"
  ],
  "#": [
    "#️⃣"
  ],
  "*": [
    "*️⃣"
  ],
  "+": [
    "➕"
  ]
};

function pickRandom(array) {
  return array[Math.floor(Math.random() * array.length)];
}

function scramble(word) {
const chars = word.split('');
  const first = chars.shift();
  const last = chars.pop();
  const output = [first];
  while (chars.length > 0) {
    const index = Math.floor(Math.random() * chars.length);
    output.push(chars[index]);
    chars.splice(index, 1);
  }
  output.push(last);
  return output.join('');
}

function obfuscate(input) {
  return input
    .split(' ')
    .map(word => {
      if (word.length > 1) {
        return scramble(word);
      }
      else {
        return word;
      }
    })
    .join(' ')
    .split('')
    .map(char => char.toUpperCase())
    .map(char => alphabet[char] || [char])
    .map(pickRandom)
    .join('');
}

const CONTEXT_MENU_ITEM_ID = 'letter-scrambler';

chrome.runtime.onInstalled.addListener(async () => {
  chrome.contextMenus.create({
    id: CONTEXT_MENU_ITEM_ID,
    title: 'Confute',
    type: 'normal',
    contexts: ['selection'],
  });
});

chrome.contextMenus.onClicked.addListener(async (item, tab) => {
  if (item.menuItemId === CONTEXT_MENU_ITEM_ID && item.selectionText) {
    const oldText = item.selectionText;
    const text = obfuscate(oldText);
    await chrome.tabs.sendMessage(tab.id, { text });
  }
});
